S16-x2-wMUSCL-hisa-maxCo5-chamfer-Euler/constant/oldcode/turbulenceProperties-basic
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


simulationType  RAS;

RAS
{
    RASModel        EARSM;  //SpalartAllmaras, kOmegaSST
    turbulence      on;
    printCoeffs     off;
}


//simulationType  LES;

//LES
{
//    LESModel        SpalartAllmarasIDDESTrans;
//    printCoeffs     no;
//    turbulence      yes;
//    delta           IDDESDelta;
//    IDDESDeltaCoeffs
//    {
//        hmax           maxDeltaxyzCubeRoot;
//        maxDeltaxyzCubeRootCoeffs
//        {
//       }
//    }


//	LESModel        XLES;
//        printCoeffs     no;
//        turbulence      yes;
//        kOmegaCoeffs
//        {
//            Cmu         0.09;  // Equivalent to betaStar
//            beta        0.075;
//            gamma       0.55;  // alpha in the article
//            alphaK      0.66;  // alphaK in the article
//            alphaOmega  0.5;   // alphaOmega in the article
//            alphaD      0.5;   // sigmaD in the article
//            productionLimiter  true;
//            shockLimiter       true;
//            stochasticModel    false;
//        }
//
//}

// ************************************************************************* //
