S16-x2-wMUSCL-hisa-maxCo5-chamfer-Euler/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Convective flux (AUSMPlusUp, HLLC)
fluxScheme          AUSMPlusUp;
lowMachAusm         false;

ddtSchemes
{
    default         dualTime rPseudoDeltaT CrankNicolson 0.9;
}

gradSchemes
{
    default         faceLeastSquares linear;
}

divSchemes
{
}

laplacianSchemes
{
}

interpolationSchemes
{
    default         linear;
//   reconstruct(rho) wVanLeer;
//    reconstruct(U)  wVanLeer;
//    reconstruct(T)  wVanLeer;

//   reconstruct(rho) Minmod;
//    reconstruct(U)  Minmod;
//    reconstruct(T)  Minmod;

   reconstruct(rho) wMUSCL;
    reconstruct(U)  wMUSCL;
    reconstruct(T)  wMUSCL;

//   reconstruct(rho) wSuperBee;
//    reconstruct(U)  wSuperBee;
//    reconstruct(T)  wSuperBee;

}

snGradSchemes
{
}


// ************************************************************************* //
